In [2]:
import pandas as pd
import numpy as np

In [3]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age, bins, labels=labels)
cats
rate = cats.count("청년")/len(cats)
rate

KeyError: ignored

In [5]:
# 1. 2차원 표
df = pd.DataFrame(np.arange(20).reshape(4,5),
                  index = list('abcd'), columns=list('vwxyz'))
df

    v   w   x   y   z
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [6]:
# 2. Dictionary list
dl = [
      {'name': 'Janmes', 'age':24, 'job':'student'},
      {'name': 'Maria', 'age':35, 'job':'teacher'},
      {'name': 'Brian', 'age':30, 'job':'programer'},
]
df = pd.DataFrame(dl)
df

     name  age        job
0  Janmes   24    student
1   Maria   35    teacher
2   Brian   30  programer

In [7]:
# 3. 여러개의 리스트
names = ['James', 'Maria', 'Brian']
ages = [24, 35, 30]
jobs = ['student', 'teacher', 'programer']
df = pd.DataFrame({
    'name': names, 'age': ages, 'job': jobs
})
df

    name  age        job
0  James   24    student
1  Maria   35    teacher
2  Brian   30  programer

In [8]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [9]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [10]:
iris.species.value_counts()

versicolor    50
setosa        50
virginica     50
Name: species, dtype: int64

In [27]:
list_ls = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [30]:
list_lt = ['setosa', 'versicolor', 'virginica']

In [35]:
for k in list_lt:
  for i in list_ls:
    print(k, i,'std', np.std(iris[iris.species == k][i]))
    print(k, i,'mean', np.mean(iris[iris.species == k][i]))

setosa sepal_length std 0.348946987377739
setosa sepal_length mean 5.005999999999999
setosa sepal_width std 0.3752545802518604
setosa sepal_width mean 3.428000000000001
setosa petal_length std 0.17191858538273286
setosa petal_length mean 1.4620000000000002
setosa petal_width std 0.10432641084595984
setosa petal_width mean 0.2459999999999999
versicolor sepal_length std 0.5109833656783752
versicolor sepal_length mean 5.936
versicolor sepal_width std 0.31064449134018135
versicolor sepal_width mean 2.7700000000000005
versicolor petal_length std 0.4651881339845204
versicolor petal_length mean 4.26
versicolor petal_width std 0.19576516544063702
versicolor petal_width mean 1.3259999999999998
virginica sepal_length std 0.6294886813914925
virginica sepal_length mean 6.587999999999998
virginica sepal_width std 0.319255383666431
virginica sepal_width mean 2.9739999999999998
virginica petal_length std 0.5463478745268441
virginica petal_length mean 5.552
virginica petal_width std 0.2718896835115301
virginica petal_width mean 2.026

In [29]:
for k in list_lt:
  for i in list_ls:
    print(k, i, np.mean(iris[iris.species == k][i]))

5.005999999999999
3.428000000000001
1.4620000000000002
0.2459999999999999

In [44]:
# 강사님
species_list, feature_list, mean_list, std_list = [],[],[],[]
for species in iris.species.unique():
  for feature in iris.columns[:-1]:
    s = iris[iris.species == species][feature]
    species_list.append(species)
    feature_list.append(feature)
    mean_list.append(np.round(s.mean(),2))
    std_list.append(np.round(s.std(),4))
pf = pd.DataFrame({
    'species': species_list,'feature': feature_list,
    'mean': mean_list, 'std': std_list
})
pf

       species       feature  mean     std
0       setosa  sepal_length  5.01  0.3525
1       setosa   sepal_width  3.43  0.3791
2       setosa  petal_length  1.46  0.1737
3       setosa   petal_width  0.25  0.1054
4   versicolor  sepal_length  5.94  0.5162
5   versicolor   sepal_width  2.77  0.3138
6   versicolor  petal_length  4.26  0.4699
7   versicolor   petal_width  1.33  0.1978
8    virginica  sepal_length  6.59  0.6359
9    virginica   sepal_width  2.97  0.3225
10   virginica  petal_length  5.55  0.5519
11   virginica   petal_width  2.03  0.2747

In [45]:
pf.set_index(['species','feature'],inplace =True)
pf

                         mean     std
species    feature
setosa     sepal_length  5.01  0.3525
           sepal_width   3.43  0.3791
           petal_length  1.46  0.1737
           petal_width   0.25  0.1054
versicolor sepal_length  5.94  0.5162
           sepal_width   2.77  0.3138
           petal_length  4.26  0.4699
           petal_width   1.33  0.1978
virginica  sepal_length  6.59  0.6359
           sepal_width   2.97  0.3225
           petal_length  5.55  0.5519
           petal_width   2.03  0.2747